# 19. Знайти корені квадратного рівняння A · x2 + B · x + C = 0, заданого своїми коефіцієнтами A, B, C (A>0),
# якщо відомо, що дискримінант рівняння позитивний. Вивести спочатку менший, а потім більший із знайдених коренів.
# Коріння квадратного рівняння знаходяться за формулою x1, x2 = (−B ± (D)1/2)/(2·A),
# де D - дискримінант, що дорівнює B2 − 4·A·C.

A = int(input('Введіть коефіцієнти квадратного рівняння'))
B = int(input('Введіть коефіцієнти квадратного рівняння'))
C = int(input('Введіть коефіцієнти квадратного рівняння'))

D = B**2 - 4*A*C

if D>0:
    x1 = (-B + D**(1/2) / (2 * A))
    x2 = (-B - D**(1/2) / (2 * A))
    if x1 > x2:
        print(x2)
        print(x1)
    elif x2 > x1:
        print(x1)
        print(x2)
else:
    print('Рівняння коренів немає')