# 10. Дана монотонна послідовність,
# в якій кожне натуральне число k зустрічається рівно k раз: 1, 2, 2, 3, 3, 3, 4, 4, 4, 4, ...
# За даним натуральному n виведіть перші n членів цієї послідовності . Спробуйте обійтися тільки одним циклом for.

k = int(input("Введіть число: "))

def posled(k):
    for i in range (k):
        print(k)
    return



